#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.github.github_repository.example: Refreshing state... [id=terraform-example]
module.github.github_repository.repository["zerotier"]: Refreshing state... [id=k8s-zerotier]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211031231641673600000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211031231641698200000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211031231641699700000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211031231641696300000002]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["reality"]: Refreshing state... [id=config/e4:5f:01:27:b9:6a.yaml]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["terraform"]: Refreshing state... [id=terraform]
module.kubernetes.module.infinity-gauntlet.module.services.module.home-assistant.helm_release.home-assistant: Refreshing state... [id=home-assistant]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_s3_bucket.bucket: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.kubernetes_namespace.namespace: Refreshing state... [id=longhorn-system]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user.user: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.services.module.default-backend.helm_release.default-backend: Refreshing state... [id=default-backend]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy_global: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.kubernetes.module.infinity-gauntlet.module.services.module.chaoskube.helm_release.chaoskube: Refreshing state... [id=chaoskube]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment_global: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211031231641725600000005]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211031231641727200000006]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.kubernetes_secret.minio_credentials_secret: Refreshing state... [id=longhorn-system/minio-credentials]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn: Refreshing state... [id=longhorn]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_service_account.service_account["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_role.role["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_role_binding.role_binding["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"]: Refreshing state... [id=k8s-zerotier:DIGITALOCEAN_AMS3_KUBECONFIG]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_namespace.namespace: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_secret.configuration: Refreshing state... [id=pi-hole-exporter/pi-hole]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.helm_release.pi-hole-exporter: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["zerotier"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["zerotier"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_service_account.service_account["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role.role["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role_binding.role_binding["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"]: Refreshing state... [id=k8s-zerotier:INFINITY_GAUNTLET_KUBECONFIG]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn has been deleted
  - resource "helm_release" "longhorn" {
      - atomic                     = true -> null
      - chart                      = "longhorn" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "longhorn" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "v1.2.2"
              - chart       = "longhorn"
              - name        = "longhorn"
              - namespace   = "longhorn-system"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - defaultSettings = {
                          - backupTarget                 = "s3://state-infinity-gauntlet-longhorn@main/"
                          - backupTargetCredentialSecret = "minio-credentials"
                          - backupstorePollInterval      = 60
                        }
                      - persistence     = {
                          - recurringJobSelector = {
                              - enable  = true
                              - jobList = jsonencode(
                                    [
                                      - {
                                          - isGroup = true
                                          - name    = "snap"
                                        },
                                      - {
                                          - isGroup = false
                                          - name    = "backup"
                                        },
                                    ]
                                )
                            }
                        }
                    }
                )
              - version     = "1.2.2"
            },
        ] -> null
      - name                       = "longhorn" -> null
      - namespace                  = "longhorn-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://charts.longhorn.io" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 900 -> null
      - values                     = [
          - <<-EOT
                "persistence":
                  "recurringJobSelector":
                    "jobList": "[{\"isGroup\":true,\"name\":\"snap\"},{\"isGroup\":false,\"name\":\"backup\"}]"
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "1.2.2" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - set {
          - name  = "defaultSettings.backupTarget" -> null
          - value = "s3://state-infinity-gauntlet-longhorn@main/" -> null
        }
      - set {
          - name  = "defaultSettings.backupTargetCredentialSecret" -> null
          - value = "minio-credentials" -> null
        }
      - set {
          - name  = "defaultSettings.backupstorePollInterval" -> null
          - value = "60" -> null
        }
      - set {
          - name  = "persistence.recurringJobSelector.enable" -> null
          - value = "true" -> null
        }
    }
  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"] has been changed
  ~ resource "kubernetes_manifest" "runner_deployment" {
      ~ object   = {
          ~ spec       = {
              ~ replicas = 0 -> 1
                # (2 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.github.github_repository.example will be updated in-place
  ~ resource "github_repository" "example" {
      ~ description            = "My awesome terraform example 909b2faa8fcc3a1058fd33a8c3f247db" -> (known after apply)
        id                     = "terraform-example"
        name                   = "terraform-example"
        # (27 unchanged attributes hidden)
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_document["state_infinity_gauntlet_etcd"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "3337559422" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_document["tftp_netboot_infinity_gauntlet"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "718304209" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_global_document["state_infinity_gauntlet_etcd"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_global_document["tftp_netboot_infinity_gauntlet"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20211031231641696300000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211031231641699700000004" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-etcd-20211031231641673600000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211031231641698200000003" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.digitalocean-ams3.module.applications.data.kubernetes_secret.token["zerotier"] will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "token"  {
      ~ data      = (sensitive value)
      ~ id        = "zerotier/zerotier-helm-token-svb8d" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "zerotier-helm-token-svb8d"
          ~ resource_version = "271688784" -> (known after apply)
          ~ uid              = "d2285f74-fb21-411d-8c9c-ca3d64711590" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes.module.digitalocean-ams3.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"] must be replaced
-/+ resource "github_actions_secret" "deployment-kubeconfig" {
      ~ created_at      = "2021-10-31 23:16:42 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "k8s-zerotier:DIGITALOCEAN_AMS3_KUBECONFIG" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-31 23:16:42 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.data.kubernetes_secret.token["zerotier"] will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "token"  {
      ~ data      = (sensitive value)
      ~ id        = "zerotier/zerotier-helm-token-c6ntt" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "zerotier-helm-token-c6ntt"
          ~ resource_version = "35346" -> (known after apply)
          ~ uid              = "71f78158-0acc-49f3-bfb3-e47357fc9e3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"] must be replaced
-/+ resource "github_actions_secret" "deployment-kubeconfig" {
      ~ created_at      = "2021-10-31 23:16:44 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "k8s-zerotier:INFINITY_GAUNTLET_KUBECONFIG" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-31 23:16:44 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration will be updated in-place
  ~ resource "kubernetes_secret" "controller_authentication_configuration" {
      ~ data      = (sensitive value)
        id        = "actions-runner-system/controller-manager"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn will be created
  + resource "helm_release" "longhorn" {
      + atomic                     = true
      + chart                      = "longhorn"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "longhorn"
      + namespace                  = "longhorn-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.longhorn.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + <<-EOT
                "persistence":
                  "recurringJobSelector":
                    "jobList": "[{\"isGroup\":true,\"name\":\"snap\"},{\"isGroup\":false,\"name\":\"backup\"}]"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.2.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "defaultSettings.backupTarget"
          + value = "s3://state-infinity-gauntlet-longhorn@main/"
        }
      + set {
          + name  = "defaultSettings.backupTargetCredentialSecret"
          + value = "minio-credentials"
        }
      + set {
          + name  = "defaultSettings.backupstorePollInterval"
          + value = "60"
        }
      + set {
          + name  = "persistence.recurringJobSelector.enable"
          + value = "true"
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.data.minio_iam_policy_document.policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "1081301387" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.data.minio_iam_policy_document.policy_global_document will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy_global must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211031231641727200000006" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment_global must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211031231641725600000005" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 15 to add, 2 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>